INSERT INTO "Виды_испытаний"("название") 
VALUES 
    ('Летное'),
    ('Термовакуумная камера'),
    ('Акустическая камера'),
    ('Коррозийный тест'),
    ('Испытание электронных систем'),
    ('Статическое испытание')
ON CONFLICT ("название") DO NOTHING;


INSERT INTO "Лаборатории"("название") 
VALUES 
    ('Летный полигон'),
    ('ХимИспЛаб'),
    ('Солнышко'),
    ('Электрон'),
    ('Лаборатория №1')
ON CONFLICT ("название") DO NOTHING;


INSERT INTO "Лаборатория_цех"("цех", "лаборатория") 
VALUES 
    (1, 1),
    (1, 2),
    (1, 3),
    (1, 4),
    (1, 5),
    (2, 3),
    (2, 4),
    (2, 5),
    (3, 2),
    (3, 3),
    (3, 5),
    (4, 1),
    (4, 2),
    (4, 5);


INSERT INTO "Испытатели" ("id", "лаборатория") 
VALUES 
    (78, 1),
    (77, 2),
    (76, 3),
    (75, 4),
    (64, 5),
    (67, 1),
    (66, 2),
    (65, 3),
    (70, 4),
    (71, 5),
    (72, 1),
    (73, 2),
    (74, 3),
    (69, 4),
    (68, 5)
ON CONFLICT ("id") DO NOTHING;


