INSERT INTO "ИТ_персонал" ("человек", "категория", "уровень_допуска", "знания_английского")
VALUES 
    (1, 3, 'A', 'B2'),
    (2, 5, 'B', 'C1'),
    (3, 8, 'C', 'A1'),
    (4, 2, 'A', 'B1'),
    (5, 9, 'B', 'C2'),
    (6, 1, 'C', 'A2'),
    (7, 4, 'A', 'B2'),
    (8, 7, 'B', 'B1'),
    (9, 6, 'C', 'C1'),
    (10, 10, 'A', 'A1'),
    (11, 3, 'A', 'C2'),
    (12, 5, 'B', 'B2'),
    (13, 8, 'C', 'A2'),
    (14, 4, 'A', 'C1'),
    (15, 9, 'B', 'B1'),
    (16, 1, 'C', 'C2'),
    (17, 6, 'A', 'A1'),
    (18, 7, 'B', 'C2'),
    (19, 10, 'C', 'B1'),
    (20, 2, 'A', 'A2')
ON CONFLICT ("человек") DO NOTHING;
