INSERT INTO "Виды_испытаний"("название") 
VALUES 
    ('Летное'),
    ('Термовакуумная камера'),
    ('Акустическая камера'),
    ('Коррозийный тест'),
    ('Испытание электронных систем'),
    ('Статическое испытание')
ON CONFLICT DO NOTHING;


INSERT INTO "Лаборатории"("название") 
VALUES 
    ('Летный полигон'),
    ('ХимИспЛаб'),
    ('Солнышко'),
    ('Электрон'),
    ('Лаборатория №1')
ON CONFLICT DO NOTHING;


INSERT INTO "Лаборатория_цех"("цех", "лаборатория") 
VALUES 
    (1, 1),
    (1, 2),
    (1, 3),
    (1, 4),
    (1, 5),
    (2, 3),
    (2, 4),
    (2, 5),
    (3, 2),
    (3, 3),
    (3, 5),
    (4, 1),
    (4, 2),
    (4, 5)
ON CONFLICT DO NOTHING;


INSERT INTO "Испытатели" ("id", "лаборатория") 
VALUES 
    (78, 1),
    (77, 2),
    (76, 3),
    (75, 4),
    (64, 5),
    (67, 1),
    (66, 2),
    (65, 3),
    (70, 4),
    (71, 5),
    (72, 1),
    (73, 2),
    (74, 3),
    (69, 4),
    (68, 5)
ON CONFLICT DO NOTHING;




INSERT INTO "Испытательное_оборудование"("вид", "название", "дата_производства", "лаборатория") 
VALUES 
    (1, 'Взлетная полоса 5км', '2010-01-01', 1),
    (1, 'Вертолетная площадка', '2010-01-01', 1),
    (1, 'Высокий склон', '2010-01-01', 1),
    (2, 'Камера высокой температуры до +70', '2011-03-02', 3),
    (2, 'Камера низкой температуры до -30', '2011-02-03', 3),
    (2, 'Камера высокой температуры до +160', '2015-03-02', 3),
    (2, 'Камера низкой температуры до -50', '2016-02-03', 3),
    (3, 'Камеры высоких частот', '2011-08-06', 4),
    (3, 'Камеры низких частот', '2011-05-08', 4),
    (4, 'Климатическая камера', '2012-09-09', 2),
    (4, 'Электрохимическая камера', '2012-03-09', 2),
    (4, 'Климатическая камера', '2012-09-09', 2),
    (4, 'Электрохимическая камера', '2012-03-09', 2),
    (5, 'Программный комплекс Зима-5.1', '2010-05-01', 4),
    (5, 'Программный комплекс Пакман-3', '2014-11-11', 4),
    (6, 'Подвешивание к потолку', '2010-01-01', 5),
    (6, 'Подъем на домкратах', '2010-01-01', 5)
ON CONFLICT DO NOTHING;

